WIP

The provided lib file only works on windows

A basic math repl

## To build and run
```console
> ./cargo run
```



## Examples
```console
> 5*5
  = 25
```

```console
> f(x) = x*x 
  defined f
> test=15
> f(test)
   = 225
```

```console
> f(x)= square(x)*2
  defined f
> square(ab) = ab*ab 
  defined square
> test=15
> f(test)
   = 450
> f(2)
   = 8
```


## Predefined functions

    sin 
    cos 
    tan 

    asin 
    acos 
    atan 

    sqrt 
    cbrt 

    exp 

    ln 
    log2 
    log10 

    floor 
    ceil 
    
    abs 